# Python and Interacting with Databases

Many of your at home projects can probably be accomplished with a handful of data files like csvs and tsvs. Sometimes though you're data may be stored in some sort of <i>relational database</i>. For a nice tutorial on what a database is watch this video later after the lecture, <a href="https://www.youtube.com/watch?v=wR0jg0eQsZA">https://www.youtube.com/watch?v=wR0jg0eQsZA</a>.

## What We'll Accomplish in this Notebook

- Introduce the concept of a relational database
- Introduce SQL
- Show off how to execute SQL commands with python
- Build our own database
- Extract data out of an existing database

Let's Go!

## Relational Databases and SQL

Here's a brief treatment on relational databases. Relational databases are a way of storing complicated data sets in a concise but smart manner. Databases allow you to store disparate data that refer to the same objects in a related way. A common example is a marketplace. Markets have inventories of products that get sold to customers. So the market may have a csv-esque file of its product inventory and a separate file of each sale and a separate file recording each customer. These three data sets are tied together with key values that, for example, tie each sale to a specific item in the inventory table and a specific customer in the customer table.

Databases are ubiquitous in industry, so knowing how to handle them is important. If you're serious you could learn how to program directly in `SQL`,  <i>the Structured Query Language</i>. This is the standard language for relational databases. `SQL` is how you can talk to a database and find the data you need. 

Since the focus of our course is `python` we're lucky that python offers a couple of ways to interact with databases both in the base python packages with `sqlite3` (`python`'s built in SQLite driver), and with an additional package `sqlalchemy` (the `python` `SQL` toolkit and Object Relational Mapper that gives application developers the full power and flexibility of `SQL`). If you installed python via the anacondas distribution you should have `sqlalchemy` installed. If not you'll need to install it before we the end of the notebook.

## `sqlite3`


We'll start with `sqlite3` and leave `sqlalchemy` to you as homework. Let's first import the package.

In [1]:
## Run this block of code to check that you have 
## the required packages installed.
import sqlite3

`sqlite3` is a `C` library built into base `python` that lets `python` to execute `SQLite` processes. All you'll need to know is that `SQLite` is essentially the Diet Coke to `SQL`'s Coca-Cola. To learn more about the differences check out this webpage <a href="https://www.geeksforgeeks.org/differences-between-sql-and-sqlite/">https://www.geeksforgeeks.org/differences-between-sql-and-sqlite/</a>.

### Constructing a Database

To better understand the structure of a relational database we'll first construct one. Imagine we're running a cat store, we sell 3 products: cat food, cat treats, and cat toys. We'll want a database to keep track of who is buying what stuff from us.

Let's go through the process step by step.

#### Creating a Connection

In [2]:
## The first step is creating a connection to the database
## This creates the connection and the database if it didn't
## already exist
conn = sqlite3.connect("cat_store.db")

## Now you can check the directory in your computer where
## you store this notebook. You should now see catstore.db
## in there.

#### Creating a Cursor Object

In [3]:
## Step 2 is to create a cursor object
## this allows us to execute SQL code chunks
## written as python strings
c = conn.cursor()

#### Executing SQL Code

We'll now go over some basic SQL code.

##### Creating a Table

The first SQL we'll do is create a table, because our database is currently empty.

In [4]:
## SQL code is written as python strings
## then placed inside cursor.execute()


## CREATE TABLE is SQL code
## it creates a table with the given name, here products
## in parantheses we list the columns of our table
## along with the SQL data type
## The PRIMARY KEY line sets the product_id as the
## primary key for this table
## Think of a primary key as being equivalent to a pandas dataframe index
## The primary key allows us to link entries across tables
c.execute("""CREATE TABLE products(
                    product_id int,
                    product text,
                    price real,
                    in_stock int,
                    PRIMARY KEY (product_id)
                )""")

## Now in order to commit the action to your database
## you run connection.commit().
conn.commit()

## Note only run this block ONCE EVER
## Running it multiple times will cause an error
## This is because we can't create a table that already exists 
## in the database

##### Entering an Entry in a Table

The next SQL we'll see is how to insert an entry into our table.

In [5]:
## INSERT INTO is the SQL code 
## it will insert whatever VALUES follows 
## into the specified table
## we'll add the cat food as product 1
## its 12.50 and we have 10 bags
c.execute("INSERT INTO products VALUES (1,'Cat Food',12.50,10)")

## Again commit this to the database.
conn.commit()

## DON'T Run this more than once.

##### Retrieving Data From a Table

Now that there is data in our table we can retrieve it.

In [6]:
## SELECT * FROM is SQL code
## it will find all entries in the specified table
c.execute("SELECT * FROM products")

## We've now selected all data from products
## We can display them with the cursor.fetchall() method
print(c.fetchall())

## Feel free to run this block as much as you want.

[(1, 'Cat Food', 12.5, 10)]

In [7]:
## Run this block to add the final two products
c.execute("INSERT INTO products VALUES (2,'Cat Treats',5.25,20)")
c.execute("INSERT INTO products VALUES (3,'Cat Toy',2.50,30)")

conn.commit()

## Only Run ONCE

In [8]:
## Now we can see all three products
c.execute("SELECT * FROM products")

## We've now selected all data from products
## We can display them with the cursor.fetchall() method
print(c.fetchall())

## Feel free to run this block as much as you want.

[(1, 'Cat Food', 12.5, 10), (2, 'Cat Treats', 5.25, 20), (3, 'Cat Toy', 2.5, 30)]

##### Getting Data With Logic Conditions

The final thing we'll go over before you build a table is how to select all entries from a table that meet a certain condition.

In [9]:
## When we use SELECT * FROM table_name
## We add a WHERE statement followed by a conditional
## let's find all the entries that cost more than $5
c.execute("SELECT * FROM products WHERE price > 5")

print(c.fetchall())

[(1, 'Cat Food', 12.5, 10), (2, 'Cat Treats', 5.25, 20)]

In [10]:
## In addition to fetchall() there is: 
## fetchone() - this reads the data you've queried one at a time, and
## fetchmany(n) - this reads the data in n sized chunks at a time
c.execute("SELECT * FROM products WHERE price > 5")

print(c.fetchone())

print()

print(c.fetchone())

(1, 'Cat Food', 12.5, 10)

(2, 'Cat Treats', 5.25, 20)

#### You Code

Now it's your turn to make a table!

Since our cat store has opened we've had five customers. It would be good for us to keep track of them so we can provide them coupons in the future.

Each unique customer should have a:
<ol>
    <li>Customer ID</li>
    <li>First Name</li>
    <li>Last Name</li>
    <li>email address</li>
    <li>number of cats they own</li>
</ol>

The Customer ID should be the primary key for the table.

It's up to you to come up with the names of the customers, just be sure that each unique customer has a unique customer id, and be sure your code is correct before running. You don't want to accidentally enter the same customer twice!

Again don't worry if you're unable to finish everything in the time alotted, do your best and you can always review this later :)

In [11]:
## You Code

## Sample Solution
c.execute("""CREATE TABLE customers(
                    customer_id int,
                    first_name text,
                    last_name text,
                    email text,
                    cats int,
                    PRIMARY KEY (customer_id)
                )""")

conn.commit()

In [12]:
## You Code

## Sample Solution
c.execute("INSERT INTO customers VALUES (1,'Marky','Mark','funkybunch@gmail.com',4)")
c.execute("INSERT INTO customers VALUES (2,'Marissa','Tomei','mtomei@yahoo.com',1)")
c.execute("INSERT INTO customers VALUES (3,'Kelsey','Grammar','cheers@roadrunner.net',2)")
c.execute("INSERT INTO customers VALUES (4,'Peter','Seattle','skyneedle@gmail.com',1)")
c.execute("INSERT INTO customers VALUES (5,'Barry','Bluejeans','barry_blue@gmail.com',10)")

conn.commit()

Now print out a list of all our customers. Then print out a list of the customers that have more than 2 cats.

In [13]:
## You Code

## Sample Solution
c.execute("SELECT * FROM customers")

print(c.fetchall())
print()

c.execute("SELECT * FROM customers WHERE cats > 2")

print(c.fetchall())

[(1, 'Marky', 'Mark', 'funkybunch@gmail.com', 4), (2, 'Marissa', 'Tomei', 'mtomei@yahoo.com', 1), (3, 'Kelsey', 'Grammar', 'cheers@roadrunner.net', 2), (4, 'Peter', 'Seattle', 'skyneedle@gmail.com', 1), (5, 'Barry', 'Bluejeans', 'barry_blue@gmail.com', 10)]

[(1, 'Marky', 'Mark', 'funkybunch@gmail.com', 4), (5, 'Barry', 'Bluejeans', 'barry_blue@gmail.com', 10)]

#### An Aside on Keys

Both `product_id` and `customer_id` serve as primary keys in the `product` and `customer` tables respectively. These keys can now be used to create foreign keys in a `purchases` table that tracks which customer buys what products throughout the life of our cat store. The foreign keys in the `purchases` table serve as a way for us to provide context by linking the purchase to the `product` and `customer` parent tables. Each purchase would have its own unique `purchase_id` as well.

#### An Aside on Memory Databases

You may have been incredibly annoyed or frustrated that you couldn't keep rerunning certain chunks of code. This is somewhat unavoidable when running each process in a separate chunk in a jupyter notebook. However, if you were writing a database script and then running the script in your terminal there is a way to be able to run the script multiple times while you're debugging it. In the `conn = sqlite3.connect("name.db")` line of code replace your database name with `":memory:"`, this will instead create a new database in your computer's RAM so any changes that are made by your code are only stored when the code runs.

In [14]:
## Closing the connection now that we're done
## When you're done with a database
## be sure to close the connection
conn.close()

### Getting Data From a Database into `pandas`

So far we've gotten a better idea on how relational databases are constructed, and we've introduced some basic `SQL` code.

While it may not be creating databases it's possible that you'll be pulling data from pre-existing databases. So for the remainder of the notebook we'll see how to get data from a database, and then turn that data into a `pandas` dataframe.

#### Looking at Census Data

We'll examine reading in data with the `census.sqlite` database. Let's connect to it now.

In [15]:
import pandas as pd

In [16]:
## conn will be our connection
conn = sqlite3.connect('census.sqlite')

## Make the cursor
c = conn.cursor()

In [17]:
## Let's print out the tables in the
## database

## Don't worry about this code, you'll typically know
## all the tables in a database before you start querying
c.execute('SELECT name FROM sqlite_master where type= "table"')

print(c.fetchall())

[('census',), ('state_fact',)]

We'll practice acessing data from these two tables to learn more about the census data.

In [18]:
## We can read in an entire table
## Let's do that with the state_fact table

## This gets all rows from the state_fact table
c.execute('SELECT * FROM state_fact')

print(c.fetchall())

[('13', 'Illinois', 'IL', 'USA', 'state', '10', 'current', 'occupied', '', '17', 'Ill.', 'V', '2', 'Midwest', '3', 'East North Central', '7'), ('30', 'New Jersey', 'NJ', 'USA', 'state', '10', 'current', 'occupied', '', '34', 'N.J.', 'II', '1', 'Northeast', '2', 'Mid-Atlantic', '3'), ('34', 'North Dakota', 'ND', 'USA', 'state', '10', 'current', 'occupied', '', '38', 'N.D.', 'VIII', '2', 'Midwest', '4', 'West North Central', '8'), ('37', 'Oregon', 'OR', 'USA', 'state', '10', 'current', 'occupied', '', '41', 'Ore.', 'X', '4', 'West', '9', 'Pacific', '9'), ('51', 'Washington DC', 'DC', 'USA', 'capitol', '10', 'current', 'occupied', '', '11', '', 'III', '3', 'South', '5', 'South Atlantic', 'D.C.'), ('49', 'Wisconsin', 'WI', 'USA', 'state', '10', 'current', 'occupied', '', '55', 'Wis.', 'V', '2', 'Midwest', '3', 'East North Central', '7'), ('3', 'Arizona', 'AZ', 'USA', 'state', '10', 'current', 'occupied', '', '4', 'Ariz.', 'IX', '4', 'West', '8', 'Mountain', '9'), ('4', 'Arkansas', 'AR', 'USA', 'state', '10', 'current', 'occupied', '', '5', 'Ark.', 'VI', '3', 'South', '7', 'West South Central', '8'), ('6', 'Colorado', 'CO', 'USA', 'state', '10', 'current', 'occupied', '', '8', 'Colo.', 'VIII', '4', 'West', '8', 'Mountain', '10'), ('11', 'Hawaii', 'HI', 'USA', 'state', '10', 'current', 'occupied', '', '15', 'Hawaii', 'IX', '4', 'West', '9', 'Pacific', '9'), ('16', 'Kansas', 'KS', 'USA', 'state', '10', 'current', 'occupied', '', '20', 'Kan.', 'VII', '2', 'Midwest', '4', 'West North Central', '10'), ('18', 'Louisiana', 'LA', 'USA', 'state', '10', 'current', 'occupied', '', '22', 'La.', 'VI', '3', 'South', '7', 'West South Central', '5'), ('26', 'Montana', 'MT', 'USA', 'state', '10', 'current', 'occupied', '', '30', 'Mont.', 'VIII', '4', 'West', '8', 'Mountain', '9'), ('27', 'Nebraska', 'NE', 'USA', 'state', '10', 'current', 'occupied', '', '31', 'Nebr.', 'VII', '2', 'Midwest', '4', 'West North Central', '8'), ('36', 'Oklahoma', 'OK', 'USA', 'state', '10', 'current', 'occupied', '', '40', 'Okla.', 'VI', '3', 'South', '7', 'West South Central', '10'), ('12', 'Idaho', 'ID', 'USA', 'state', '10', 'current', 'occupied', '', '16', 'Idaho', 'X', '4', 'West', '8', 'Mountain', '9'), ('21', 'Massachusetts', 'MA', 'USA', 'state', '10', 'current', 'occupied', '', '25', 'Mass.', 'I', '1', 'Northeast', '1', 'New England', '1'), ('22', 'Michigan', 'MI', 'USA', 'state', '10', 'current', 'occupied', '', '26', 'Mich.', 'V', '2', 'Midwest', '3', 'East North Central', '6'), ('25', 'Missouri', 'MO', 'USA', 'state', '10', 'current', 'occupied', '', '29', 'Mo.', 'VII', '2', 'Midwest', '4', 'West North Central', '8'), ('33', 'North Carolina', 'NC', 'USA', 'state', '10', 'current', 'occupied', '', '37', 'N.C.', 'IV', '3', 'South', '5', 'South Atlantic', '4'), ('35', 'Ohio', 'OH', 'USA', 'state', '10', 'current', 'occupied', '', '39', 'Ohio', 'V', '2', 'Midwest', '3', 'East North Central', '6'), ('39', 'Rhode Island', 'RI', 'USA', 'state', '10', 'current', 'occupied', '', '44', 'R.I.', 'I', '1', 'Northeast', '1', 'New England', '1'), ('40', 'South Carolina', 'SC', 'USA', 'state', '10', 'current', 'occupied', '', '45', 'S.C.', 'IV', '3', 'South', '5', 'South Atlantic', '4'), ('50', 'Wyoming', 'WY', 'USA', 'state', '10', 'current', 'occupied', '', '56', 'Wyo.', 'VIII', '4', 'West', '8', 'Mountain', '10'), ('14', 'Indiana', 'IN', 'USA', 'state', '10', 'current', 'occupied', '', '18', 'Ind.', 'V', '2', 'Midwest', '3', 'East North Central', '7'), ('38', 'Pennsylvania', 'PA', 'USA', 'state', '10', 'current', 'occupied', '', '42', 'Pa.', 'III', '1', 'Northeast', '2', 'Mid-Atlantic', '3'), ('41', 'South Dakota', 'SD', 'USA', 'state', '10', 'current', 'occupied', '', '46', 'S.D.', 'VIII', '2', 'Midwest', '4', 'West North Central', '8'), ('42', 'Tennessee', 'TN', 'USA', 'state', '10', 'current', 'occupied', '', '47', 'Tenn.', 'IV', '3', 'South', '6', 'East South Central', '6'), ('45', 'Vermont', 'VT', 'USA', 'state', '10', 'current', 'occupied', '', '50', 'Vt.', 'I', '1', 'Northeast', '1', 'New England', '2'), ('2', 'Alaska', 'AK', 'USA', 'state', '10', 'current', 'occupied', '', '2', 'Alaska', 'X', '4', 'West', '9', 'Pacific', '9'), ('8', 'Delaware', 'DE', 'USA', 'state', '10', 'current', 'occupied', '', '10', 'Del.', 'III', '3', 'South', '5', 'South Atlantic', '3'), ('17', 'Kentucky', 'KY', 'USA', 'state', '10', 'current', 'occupied', '', '21', 'Ky.', 'IV', '3', 'South', '6', 'East South Central', '6'), ('24', 'Mississippi', 'MS', 'USA', 'state', '10', 'current', 'occupied', '', '28', 'Miss.', 'IV', '3', 'South', '6', 'East South Central', '5'), ('46', 'Virginia', 'VA', 'USA', 'state', '10', 'current', 'occupied', '', '51', 'Va.', 'III', '3', 'South', '5', 'South Atlantic', '4'), ('9', 'Florida', 'FL', 'USA', 'state', '10', 'current', 'occupied', '', '12', 'Fla.', 'IV', '3', 'South', '5', 'South Atlantic', '11'), ('20', 'Maryland', 'MD', 'USA', 'state', '10', 'current', 'occupied', '', '24', 'Md.', 'III', '3', 'South', '5', 'South Atlantic', '4'), ('28', 'Nevada', 'NV', 'USA', 'state', '10', 'current', 'occupied', '', '32', 'Nev.', 'IX', '4', 'West', '8', 'Mountain', '9'), ('47', 'Washington', 'WA', 'USA', 'state', '10', 'current', 'occupied', '', '53', 'Wash.', 'X', '4', 'West', '9', 'Pacific', '9'), ('5', 'California', 'CA', 'USA', 'state', '10', 'current', 'occupied', '', '6', 'Calif.', 'IX', '4', 'West', '9', 'Pacific', '9'), ('7', 'Connecticut', 'CT', 'USA', 'state', '10', 'current', 'occupied', '', '9', 'Conn.', 'I', '1', 'Northeast', '1', 'New England', '2'), ('10', 'Georgia', 'GA', 'USA', 'state', '10', 'current', 'occupied', '', '13', 'Ga.', 'IV', '3', 'South', '5', 'South Atlantic', '11'), ('15', 'Iowa', 'IA', 'USA', 'state', '10', 'current', 'occupied', '', '19', 'Iowa', 'VII', '2', 'Midwest', '4', 'West North Central', '8'), ('19', 'Maine', 'ME', 'USA', 'state', '10', 'current', 'occupied', '', '23', 'Maine', 'I', '1', 'Northeast', '1', 'New England', '1'), ('29', 'New Hampshire', 'NH', 'USA', 'state', '10', 'current', 'occupied', '', '33', 'N.H.', 'I', '1', 'Northeast', '1', 'New England', '1'), ('31', 'New Mexico', 'NM', 'USA', 'state', '10', 'current', 'occupied', '', '35', 'N.M.', 'VI', '4', 'West', '8', 'Mountain', '10'), ('43', 'Texas', 'TX', 'USA', 'state', '10', 'current', 'occupied', '', '48', 'Texas', 'VI', '3', 'South', '7', 'West South Central', '5'), ('1', 'Alabama', 'AL', 'USA', 'state', '10', 'current', 'occupied', '', '1', 'Ala.', 'IV', '3', 'South', '6', 'East South Central', '11'), ('23', 'Minnesota', 'MN', 'USA', 'state', '10', 'current', 'occupied', '', '27', 'Minn.', 'V', '2', 'Midwest', '4', 'West North Central', '8'), ('32', 'New York', 'NY', 'USA', 'state', '10', 'current', 'occupied', '', '36', 'N.Y.', 'II', '1', 'Northeast', '2', 'Mid-Atlantic', '2'), ('44', 'Utah', 'UT', 'USA', 'state', '10', 'current', 'occupied', '', '49', 'Utah', 'VIII', '4', 'West', '8', 'Mountain', '10'), ('48', 'West Virginia', 'WV', 'USA', 'state', '10', 'current', 'occupied', '', '54', 'W.Va.', 'III', '3', 'South', '5', 'South Atlantic', '4')]

In [19]:
## Alright that is difficult to read!
## Let's turn it into a dataframe!
c.execute("SELECT * FROM state_fact")

pd.DataFrame(c.fetchall()).head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16
0,13,Illinois,IL,USA,state,10,current,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
1,30,New Jersey,NJ,USA,state,10,current,occupied,,34,N.J.,II,1,Northeast,2,Mid-Atlantic,3
2,34,North Dakota,ND,USA,state,10,current,occupied,,38,N.D.,VIII,2,Midwest,4,West North Central,8
3,37,Oregon,OR,USA,state,10,current,occupied,,41,Ore.,X,4,West,9,Pacific,9
4,51,Washington DC,DC,USA,capitol,10,current,occupied,,11,,III,3,South,5,South Atlantic,D.C.

In [20]:
## Much nicer!
## We can also get informative column titles like so
c.execute("SELECT * FROM state_fact")

## The data we selected from the table comes
## with a "description", which is the column labels
## we can access those with a quick list comprehension
state_fact = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])

In [21]:
## Let's examine the table's first ten entries
state_fact.head(10)

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,13,Illinois,IL,USA,state,10,current,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
1,30,New Jersey,NJ,USA,state,10,current,occupied,,34,N.J.,II,1,Northeast,2,Mid-Atlantic,3
2,34,North Dakota,ND,USA,state,10,current,occupied,,38,N.D.,VIII,2,Midwest,4,West North Central,8
3,37,Oregon,OR,USA,state,10,current,occupied,,41,Ore.,X,4,West,9,Pacific,9
4,51,Washington DC,DC,USA,capitol,10,current,occupied,,11,,III,3,South,5,South Atlantic,D.C.
5,49,Wisconsin,WI,USA,state,10,current,occupied,,55,Wis.,V,2,Midwest,3,East North Central,7
6,3,Arizona,AZ,USA,state,10,current,occupied,,4,Ariz.,IX,4,West,8,Mountain,9
7,4,Arkansas,AR,USA,state,10,current,occupied,,5,Ark.,VI,3,South,7,West South Central,8
8,6,Colorado,CO,USA,state,10,current,occupied,,8,Colo.,VIII,4,West,8,Mountain,10
9,11,Hawaii,HI,USA,state,10,current,occupied,,15,Hawaii,IX,4,West,9,Pacific,9

In [22]:
## Now we can query the table in two ways
## One way is to use SQL queries
## Lets find all the states in census_region 2

## The SQL way
c.execute('SELECT * FROM state_fact WHERE census_region == 2')

## view results as dataframe in state alphabetical order
pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description]).sort_values("name")

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,13,Illinois,IL,USA,state,10,current,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
8,14,Indiana,IN,USA,state,10,current,occupied,,18,Ind.,V,2,Midwest,3,East North Central,7
10,15,Iowa,IA,USA,state,10,current,occupied,,19,Iowa,VII,2,Midwest,4,West North Central,8
3,16,Kansas,KS,USA,state,10,current,occupied,,20,Kan.,VII,2,Midwest,4,West North Central,10
5,22,Michigan,MI,USA,state,10,current,occupied,,26,Mich.,V,2,Midwest,3,East North Central,6
11,23,Minnesota,MN,USA,state,10,current,occupied,,27,Minn.,V,2,Midwest,4,West North Central,8
6,25,Missouri,MO,USA,state,10,current,occupied,,29,Mo.,VII,2,Midwest,4,West North Central,8
4,27,Nebraska,NE,USA,state,10,current,occupied,,31,Nebr.,VII,2,Midwest,4,West North Central,8
1,34,North Dakota,ND,USA,state,10,current,occupied,,38,N.D.,VIII,2,Midwest,4,West North Central,8
7,35,Ohio,OH,USA,state,10,current,occupied,,39,Ohio,V,2,Midwest,3,East North Central,6
9,41,South Dakota,SD,USA,state,10,current,occupied,,46,S.D.,VIII,2,Midwest,4,West North Central,8
2,49,Wisconsin,WI,USA,state,10,current,occupied,,55,Wis.,V,2,Midwest,3,East North Central,7

In [23]:
## Now the pandas way
## note the census_region was read in as a string not a numeric
state_fact.loc[state_fact.census_region == '2',].sort_values("name")

,id,name,abbreviation,country,type,sort,status,occupied,notes,fips_state,assoc_press,standard_federal_region,census_region,census_region_name,census_division,census_division_name,circuit_court
0,13,Illinois,IL,USA,state,10,current,occupied,,17,Ill.,V,2,Midwest,3,East North Central,7
24,14,Indiana,IN,USA,state,10,current,occupied,,18,Ind.,V,2,Midwest,3,East North Central,7
41,15,Iowa,IA,USA,state,10,current,occupied,,19,Iowa,VII,2,Midwest,4,West North Central,8
10,16,Kansas,KS,USA,state,10,current,occupied,,20,Kan.,VII,2,Midwest,4,West North Central,10
17,22,Michigan,MI,USA,state,10,current,occupied,,26,Mich.,V,2,Midwest,3,East North Central,6
47,23,Minnesota,MN,USA,state,10,current,occupied,,27,Minn.,V,2,Midwest,4,West North Central,8
18,25,Missouri,MO,USA,state,10,current,occupied,,29,Mo.,VII,2,Midwest,4,West North Central,8
13,27,Nebraska,NE,USA,state,10,current,occupied,,31,Nebr.,VII,2,Midwest,4,West North Central,8
2,34,North Dakota,ND,USA,state,10,current,occupied,,38,N.D.,VIII,2,Midwest,4,West North Central,8
20,35,Ohio,OH,USA,state,10,current,occupied,,39,Ohio,V,2,Midwest,3,East North Central,6
26,41,South Dakota,SD,USA,state,10,current,occupied,,46,S.D.,VIII,2,Midwest,4,West North Central,8
5,49,Wisconsin,WI,USA,state,10,current,occupied,,55,Wis.,V,2,Midwest,3,East North Central,7

#### You Code

Now you explore the `census` table in the `census` database. 

What are the columns?

Subset the data to only output the Ohio rows. Do this in two ways, the `SQL` way and the `pandas` way.

How do the average ages in Ohio in 2000 and 2008 compare?

Now subset the data so that you only have people older than 80 (from all states). Which state has the most people 80 or above?

Get as much done as you can in the breakout session, it's okay if you're unable to complete it all! :)

In [24]:
## You Code

## Sample Answer
c.execute("SELECT * FROM census")
census = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])

census.head()

      state sex  age  pop2000  pop2008
0  Illinois   M    0    89600    95012
1  Illinois   M    1    88445    91829
2  Illinois   M    2    88729    89547
3  Illinois   M    3    88868    90037
4  Illinois   M    4    91947    91111

In [25]:
## You Code

ohio = census.loc[census.state == "Ohio",]

# or
c.execute("SELECT * FROM census WHERE state = 'Ohio'")
ohio = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
ohio.head()

  state sex  age  pop2000  pop2008
0  Ohio   M    0    76427    78012
1  Ohio   M    1    75867    77502
2  Ohio   M    2    76503    75206
3  Ohio   M    3    76428    74289
4  Ohio   M    4    79291    75660

In [26]:
## You Code

## Sample Answer
total_age_2000 = 0
total_age_2008 = 0

for i in ohio.index:
    total_age_2000 = total_age_2000 + ohio.iloc[i]['age']*ohio.iloc[i]['pop2000']
    total_age_2008 = total_age_2008 + ohio.iloc[i]['age']*ohio.iloc[i]['pop2008']


print("The mean age in 2000 was",total_age_2000/ohio.pop2000.sum())
print("The mean age in 2008 was",total_age_2008/ohio.pop2008.sum())

The mean age in 2000 was 36.40755661938441
The mean age in 2008 was 37.76612703804952

In [27]:
## You Code

## Sample Answer
c.execute("SELECT * FROM census WHERE age >= 80")
old = pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description])
old.head()

      state sex  age  pop2000  pop2008
0  Illinois   M   80    19729    20725
1  Illinois   M   81    17222    19151
2  Illinois   M   82    15811    17433
3  Illinois   M   83    13553    16064
4  Illinois   M   84    12073    14569

In [28]:
## You Code

## Sample Answer
old.groupby('state').pop2000.sum().sort_values(ascending=False)

state
California              938967
Florida                 745998
New York                664095
Pennsylvania            531344
Texas                   511778
Illinois                413949
Ohio                    395262
Michigan                318880
New Jersey              300904
Massachusetts           249437
North Carolina          236297
Missouri                206524
Wisconsin               202226
Indiana                 199265
Virginia                195831
Georgia                 194136
Washington              184164
Tennessee               177398
Minnesota               177278
Arizona                 162035
Maryland                151122
Alabama                 146277
Connecticut             138637
Iowa                    133648
Louisiana               128225
Kentucky                127216
Oregon                  124944
Oklahoma                120440
South Carolina          115098
Kansas                  105925
Colorado                105145
Arkansas                100004
Mississippi              89984
West Virginia            70204
Nebraska                 69023
New Mexico               51410
Utah                     49587
Maine                    49578
Rhode Island             44986
Nevada                   43135
Hawaii                   40523
Idaho                    39960
New Hampshire            39472
Montana                  34031
South Dakota             32718
North Dakota             29693
Delaware                 24349
Vermont                  21117
District of Columbia     19067
Wyoming                  14692
Alaska                    6451
Name: pop2000, dtype: int64

In [29]:
## You Code

## Sample Answer
old.groupby('state').pop2008.sum().sort_values(ascending=False)

state
California              1220781
Florida                 1032695
New York                 787683
Texas                    677492
Pennsylvania             621951
Illinois                 472032
Ohio                     467473
Michigan                 381334
New Jersey               349140
North Carolina           308811
Massachusetts            278826
Virginia                 253174
Arizona                  252811
Georgia                  251152
Missouri                 239701
Indiana                  239000
Wisconsin                230370
Washington               226029
Tennessee                219109
Minnesota                202446
Maryland                 188607
Alabama                  175743
South Carolina           159331
Kentucky                 153719
Connecticut              152848
Oregon                   150773
Louisiana                149510
Iowa                     148398
Oklahoma                 139785
Colorado                 137565
Kansas                   118615
Arkansas                 117012
Mississippi              104839
West Virginia             81208
Nebraska                  78029
New Mexico                72962
Nevada                    71000
Utah                      67919
Hawaii                    63317
Maine                     58021
Idaho                     51256
Rhode Island              50141
New Hampshire             49045
Montana                   40043
South Dakota              38602
Delaware                  33586
North Dakota              32778
Vermont                   24959
District of Columbia      21285
Wyoming                   18190
Alaska                    10516
Name: pop2008, dtype: int64

#### An Aside on `SELECT`

So far we've been using `SELECT *`. We can also get specific columns by replacing `*` with specific column names.

In [30]:
## Here we'll only get the state names in census_region 2
c.execute('SELECT name FROM state_fact WHERE census_region == 2')

## View as a dataframe sorted alphabetically
pd.DataFrame(c.fetchall(), columns = [x[0] for x in c.description]).sort_values('name')

            name
0       Illinois
8        Indiana
10          Iowa
3         Kansas
5       Michigan
11     Minnesota
6       Missouri
4       Nebraska
1   North Dakota
7           Ohio
9   South Dakota
2      Wisconsin

In [31]:
# Close the connection because we're done
conn.close()

### Why Would I Ever Do Things the `SQL` Way?

By now you know a lot of `pandas` and probably not so much `SQL`. So why would you ever want to do things the `SQL` way. There are a few reasons.

<ol>
    <li>SQL was made to operate on databases, so it tends to be faster on certain tasks like filtering, selecting and sorting. Check out this nice data incubator blog post <a href="https://blog.thedataincubator.com/2018/05/sqlite-vs-pandas-performance-benchmarks/">https://blog.thedataincubator.com/2018/05/sqlite-vs-pandas-performance-benchmarks/</a>.</li>
    <li>Our databases were quite small so it wasn't a big deal to turn the entire tables into dataframes. However, imagine a customer database for someone like Amazon, or a census database that contains every single census response. It would be unwise to default to storing this data as a pandas dataframe.</li>
    <li>It's better to have two approaches to a problem than just one. So sometimes it's nice to practice the SQL way even if you already have the pandas way.</li>
</ol>

As with most things the approach you take will depend on the use case. When you approach a problem use your best judgement and if you're unsure find someone with more experience and ask for their advice on which approach to use.

## That's it!

That's it for this notebook, check out the `Data Gathering` homework to learn about `sqlalchemy` and get some more practice with SQL in python!

Tomorrow we'll look at Regression!

This notebook was written for the Erd&#337;s Institute C&#337;de Data Science Boot Camp by Matthew Osborne, Ph. D., 2021.

Redistribution of the material contained in this repository is conditional on acknowledgement of Matthew Tyler Osborne, Ph.D.'s original authorship and sponsorship of the Erds Institute as subject to the license (see License.md)